// Задача 27: Напишите программу, 
// 1 которая принимает на вход число 
// 2 и выдаёт сумму цифр в числе.

// 452 -> 11
// 82 -> 10
// 9012 -> 12
System.Console.WriteLine("Ввидите число");
int A = 111;//Convert.ToInt32(System.Console.ReadLine());
void SumNumber(int num)
{
    
    for (int i = 0; i < ; i +)
    {
        int result = 0;
        sum = num % 10;
        result = sum + result;



    }

    System.Console.WriteLine($"{A} -> {result + lastdigit}");
}
SumNumber(A);
