// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// 2, 3, 7 -> 7
// 44, 5, 78 -> 78
// 22, 3, 9 -> 22

Console.Writeline("Виидите число 1: ");
int Array [0] = Convert.ToInt32(Console.ReadLine());
Console.Writeline("Виидите число 2: ");
int Array [1]  = Convert.ToInt32(Console.ReadLine());
Console.Writeline("Виидите число 3: ");
int Array [2]  = Convert.ToInt32(Console.ReadLine());
int [] Array; // укладываем наши числа в массив
Array = new int [3];
int max = 0
int index = 0
while (index < 2) // какой индекс 3 или 2
{
    (max < Array []);
    (max = Array []);
    index++
}

Console.ReadLine(max);